Revit 2027 API
ElectricalLoadAreaData.GetAreaBasedLoadIds Method
 Gets the area based load ids of the electrical load area to be included.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAreaBasedLoadIds()
Public Function GetAreaBasedLoadIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAreaBasedLoadIds()
member GetAreaBasedLoadIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace